package day03;

public class Extra01 {
	/*
		전은석 선생님이 건망증이 엄청나게 심하다.
		가끔 차번호까지, 심지어는 차종도 잊기도 한다.
		그런데 어느날 반장님과 함께 주차장에서 차를 찾고 있다.
		그런데 어떤차인지 기억이 나지 않는다.
		그런데 수첩에 다음과 같은 이상황을 해결할 힌트를 메모해놓았다.
		
		1. 4자리의 숫자 ABCD는 0 이 포함되어있지 않고, 모두 다른 숫자이다.
		2. 첫번째 숫자 A는 마지막 숫자 D보다 2가 크다.
		3. 두번째 숫자가 세번째 숫자보다 크다.
		4. 전화번호 뒤의 4자리를 역순으로 배열하면 번호판 숫자가 된다.
		
		반장님이 
			"다른건 안봐도 되겠네요. 전화번호가 몇번이죠?" 라고 질문한다.
		그런데 저는 생각이 나지 않는다.
		그런데 갑자기 생각나는 것은 
			전화번호와 번호판 숫자를 더한 숫자가 16456
		이라는 것만 생각이 난다.
		
		제 차를 찾아주세요!
	 */
}
